app/controllers/api/v1/columns_controller.rb

INSERT INTO "columns" ("name", "columnable_type", "columnable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "project"], ["columnable_type", "Desk"], ["columnable_id", 1], ["created_at", "2023-03-19 19:14:30.040360"], ["updated_at", "2023-03-19 19:14:30.040360"]]
---
  def create
    @column = Column.new(column_params)
    if @column.save

SELECT "columns".* FROM "columns" WHERE "columns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_column
    @column = Column.find(params[:id])

SELECT "columns".* FROM "columns"
---
  def set_columns
    @columns = Column.all