app/controllers/api/v1/desks_controller.rb

INSERT INTO "desks" ("name", "project_id", "created_at", "updated_at", "columnable_type", "columnable_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "project"], ["project_id", 1], ["created_at", "2023-03-19 19:49:11.218922"], ["updated_at", "2023-03-19 19:49:11.218922"], ["columnable_type", nil], ["columnable_id", nil]]
---
  def create
    desk = Desk.new(desk_params)

    if desk.save

SELECT "desks".* FROM "desks" WHERE "desks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_desk
    @desk = Desk.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_desks
    project = Project.find(desk_params[:project_id])