app/controllers/api/v1/projects_controller.rb

  def create
    @project = Project.new(project_params)
    @project.user_id = @current_user.id
    @project.save
---
INSERT INTO "projects" ("name", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "project"], ["status", 0], ["user_id", 1], ["created_at", "2023-03-19 16:39:02.813815"], ["updated_at", "2023-03-19 16:39:02.813815"]]

  def update
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_project
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_projects
    @projects = Project.where(user_id: @current_user)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", nil]]