app/controllers/api/v1/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "priority", "status", "label", "estimate", "start", "end", "assignee_id", "created_at", "updated_at", "user_id", "project_id", "desk_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @task = Task.new(task_params)
    @task.user_id = @current_user.id
    # authorize @task

    if @task.save

SELECT "tasks".* FROM "tasks"
---
  def set_tasks
    @tasks = Task.all