app/controllers/api/v1/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at", "last_name", "email", "reset_password_token", "reset_password_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    unless @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Sergio444444"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-03-19 13:14:56.013911"], ["id", 6]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]